Import the required Python libraries

In [26]:


import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

dataset

In [27]:
dataset = pd.read_csv('Data/Covid Explorer Inputs Prod - FoodBasket (1).csv')
dataset

             iso3    countryname            ChangeInFoodBasketCost
0   #country+code  #country+name  #indicator+foodbasket+change+pct
1             ABW          Aruba                               NaN
2             AFG    Afghanistan                              0.04
3             AGO         Angola                               NaN
4             ARG      Argentina                               NaN
..            ...            ...                               ...
59            URY        Uruguay                               NaN
60            UZB     Uzbekistan                               NaN
61            VEN      Venezuela                               NaN
62            YEM          Yemen                             -0.09
63            ZMB         Zambia                             -0.01

[64 rows x 3 columns]

 Exploratory data analysis

We can check the dimensions of the data with df.shape attribute

In [28]:
dataset.shape

(64, 3)

We can view the top five and bottom five rows of the dataset with df.head() and df.tail() methods respectively.

In [29]:
dataset.head()

            iso3    countryname            ChangeInFoodBasketCost
0  #country+code  #country+name  #indicator+foodbasket+change+pct
1            ABW          Aruba                               NaN
2            AFG    Afghanistan                              0.04
3            AGO         Angola                               NaN
4            ARG      Argentina                               NaN

In [33]:
dataset.tail()

   iso3 countryname ChangeInFoodBasketCost
59  URY     Uruguay                    NaN
60  UZB  Uzbekistan                    NaN
61  VEN   Venezuela                    NaN
62  YEM       Yemen                  -0.09
63  ZMB      Zambia                  -0.01

We can get a concise summary of the dataset with df.info() method. This method prints information about a DataFrame including the index dtype and column dtypes, non-null values and memory usage

In [30]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   iso3                    64 non-null     object
 1   countryname             64 non-null     object
 2   ChangeInFoodBasketCost  34 non-null     object
dtypes: object(3)
memory usage: 1.6+ KB

We can check the data types of each column in the dataframe with df.dtypes attribute. The above command returns the data type of each column.

In [34]:
dataset.dtypes

iso3                      object
countryname               object
ChangeInFoodBasketCost    object
dtype: object

In [31]:
dataset.columns

Index(['iso3', 'countryname', 'ChangeInFoodBasketCost'], dtype='object')

In [32]:
dataset.describe()

                 iso3    countryname ChangeInFoodBasketCost
count              64             64                     34
unique             64             64                     21
top     #country+code  #country+name                   0.05
freq                1              1                      4

In [6]:
dataset["countryname"] = pd.to_numeric(dataset["iso3"], errors='coerce')

In [7]:
dataset.dtypes

iso3                       object
countryname               float64
ChangeInFoodBasketCost     object
dtype: object

In [10]:
dataset.shape

(64, 3)

In [36]:
dataset["ChangeInFoodBasketCost"] = pd.to_numeric(dataset["ChangeInFoodBasketCost"],errors ='coerce')

In [41]:
dataset["countryname"] = dataset["countryname"].fillna(0.0)

In [42]:
dataset["iso3"] = dataset["iso3"].fillna(0.0)

In [43]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   iso3                    64 non-null     object
 1   countryname             64 non-null     object
 2   ChangeInFoodBasketCost  33 non-null     float64
dtypes: float64(1), object(2)
memory usage: 1.6+ KB

In [8]:
print(dataset.head().to_markdown())

|    | iso3          |   countryname | ChangeInFoodBasketCost           |
|---:|:--------------|--------------:|:---------------------------------|
|  0 | #country+code |           nan | #indicator+foodbasket+change+pct |
|  1 | ABW           |           nan | nan                              |
|  2 | AFG           |           nan | 0.04                             |
|  3 | AGO           |           nan | nan                              |
|  4 | ARG           |           nan | nan                              |

In [9]:
dataset.tail()

   iso3  countryname ChangeInFoodBasketCost
59  URY          NaN                    NaN
60  UZB          NaN                    NaN
61  VEN          NaN                    NaN
62  YEM          NaN                  -0.09
63  ZMB          NaN                  -0.01